In [2]:
import pandas as pd

# resources/data_with_nan.csv
# /Users/uuboy.scy/side-project/tibame/tjr103/data_pipeline/resources/data_with_nan.csv
filename = r"resources/data_with_nan.csv"

df = pd.read_csv(filename)

df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [3]:
df["col3"][0]

nan

In [4]:
type(df["col3"][0])

float

In [5]:
type(None)

NoneType

In [6]:
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [8]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [7]:
df.dropna(thresh=1)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [9]:
df[
    df["col1"].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [10]:
df[
    df["col1"].notna()
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [11]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [14]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [15]:
df["col1"].fillna("unknown")

0      test1
1      test2
2      test3
3    unknown
4      test5
5    unknown
Name: col1, dtype: object

In [16]:
df["col2"].fillna(df["col2"].mean())

0    13.0
1    44.0
2    28.5
3    28.5
4    28.5
5    28.5
Name: col2, dtype: float64